In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("test.csv")

In [3]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
def percent_missing(df):
    percent_nan = 100*df.isnull().sum()/len(df)
    total_percent_nan = percent_nan[percent_nan>0].sort_values()
    
    return total_percent_nan

In [5]:
percent_missing(df)

Fare      0.239234
Age      20.574163
Cabin    78.229665
dtype: float64

In [6]:
df['Age'] = df['Fare'].fillna(df['Age'].mean())

In [7]:
df['Fare'] = df['Fare'].fillna(df['Fare'].mean())

In [8]:
df = df.drop('Cabin',axis=1)

In [9]:
df = df.drop('Name',axis=1)

In [10]:
df = df.drop('Ticket',axis=1)

In [11]:
df.shape

(418, 8)

In [12]:
df_numeric_values = df.select_dtypes(exclude='object')
df_objective_values = df.select_dtypes(include='object')

In [13]:
df_objective_values = pd.get_dummies(df_objective_values,drop_first=True)

In [14]:
df_objective_values

     Sex_male  Embarked_Q  Embarked_S
0           1           1           0
1           0           0           1
2           1           1           0
3           1           0           1
4           0           0           1
..        ...         ...         ...
413         1           0           1
414         0           0           0
415         1           0           1
416         1           0           1
417         1           0           0

[418 rows x 3 columns]

In [15]:
df.to_csv("Cleaned_Test_data.csv",index=False)

In [16]:
# df['Cabin'].unique()

In [17]:
df_objective_values

     Sex_male  Embarked_Q  Embarked_S
0           1           1           0
1           0           0           1
2           1           1           0
3           1           0           1
4           0           0           1
..        ...         ...         ...
413         1           0           1
414         0           0           0
415         1           0           1
416         1           0           1
417         1           0           0

[418 rows x 3 columns]